AcDbEntity
Creates a new non-database resident AcDbPoint from then data the AcDbVertexRef
holds, and returns it to the caller. The caller is responsible for deleting
the AcDbPoint after it is no more needed.